; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	image2 - mode
	infrared3 - mode
	image1 - mode
	spectrograph4 - mode
	thermograph0 - mode
	GroundStation0 - direction
	GroundStation6 - direction
	Star4 - direction
	Star5 - direction
	Star2 - direction
	Star1 - direction
	GroundStation3 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 infrared3)
	(supports instrument2 spectrograph4)
	(calibration_target instrument2 Star4)
	(supports instrument3 image2)
	(supports instrument3 infrared3)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument4 image2)
	(supports instrument4 thermograph0)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation6)
	(supports instrument5 image2)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 Star4)
	(supports instrument6 image2)
	(supports instrument6 infrared3)
	(calibration_target instrument6 Star1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
	(supports instrument7 spectrograph4)
	(calibration_target instrument7 Star1)
	(calibration_target instrument7 Star4)
	(supports instrument8 image2)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 Star2)
	(supports instrument9 image1)
	(calibration_target instrument9 Star1)
	(calibration_target instrument9 Star2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument10 spectrograph4)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 GroundStation3)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation6)
)
(:goal (and
	(pointing satellite0 GroundStation6)
	(pointing satellite3 Phenomenon7)
	(pointing satellite4 Star2)
	(have_image Phenomenon7 image2)
	(have_image Star8 spectrograph4)
	(have_image Phenomenon9 spectrograph4)
	(have_image Star10 image1)
))

)

; plan
1. (switch_on instrument9 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument9)
   goals met: 0 of 7
2. (calibrate satellite3 instrument9 star2)
   added: (calibrated instrument9)
   goals met: 0 of 7
3. (turn_to satellite3 star10 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 star10)
   goals met: 0 of 7
4. (turn_to satellite2 groundstation6 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 groundstation6)
   goals met: 0 of 7
5. (turn_to satellite0 groundstation6 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 groundstation6)
   goals met: 1 of 7
6. (take_image satellite3 star10 instrument9 image1)
   added: (have_image star10 image1)
   goals met: 2 of 7
7. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 2 of 7
8. (calibrate satellite2 instrument4 groundstation6)
   added: (calibrated instrument4)
   goals met: 2 of 7
9. (turn_to satellite2 phenomenon7 groundstation6)
   deleted: (pointing satellite2 groundstation6)
   added: (pointing satellite2 phenomenon7)
   goals met: 2 of 7
10. (take_image satellite2 phenomenon7 instrument4 image2)
   added: (have_image phenomenon7 image2)
   goals met: 3 of 7
11. (turn_to satellite2 phenomenon9 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon9)
   goals met: 3 of 7
12. (take_image satellite2 phenomenon9 instrument4 spectrograph4)
   added: (have_image phenomenon9 spectrograph4)
   goals met: 4 of 7
13. (turn_to satellite2 star8 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 star8)
   goals met: 4 of 7
14. (take_image satellite2 star8 instrument4 spectrograph4)
   added: (have_image star8 spectrograph4)
   goals met: 5 of 7
15. (turn_to satellite3 phenomenon7 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 phenomenon7)
   goals met: 6 of 7
16. (turn_to satellite4 star2 groundstation6)
   deleted: (pointing satellite4 groundstation6)
   added: (pointing satellite4 star2)
   goals met: 7 of 7
